esp8266/Arduino/boards.txt
##############################################################
thingdev.name=SparkFun ESP8266 Thing Dev
thingdev.build.board=ESP8266_THING_DEV
thingdev.build.variant=thing
thingdev.upload.tool=esptool
thingdev.upload.maximum_data_size=81920
thingdev.upload.wait_for_upload_port=true
thingdev.serial.disableDTR=true
thingdev.serial.disableRTS=true
thingdev.build.mcu=esp8266
thingdev.build.core=esp8266
thingdev.build.spiffs_pagesize=256
thingdev.build.debug_port=
thingdev.build.debug_level=
thingdev.menu.CpuFrequency.80=80 MHz
thingdev.menu.CpuFrequency.80.build.f_cpu=80000000L
thingdev.menu.CpuFrequency.160=160 MHz
thingdev.menu.CpuFrequency.160.build.f_cpu=160000000L
thingdev.upload.resetmethod=nodemcu
thingdev.build.flash_mode=dio
thingdev.build.flash_freq=40
thingdev.menu.FlashSize.512K0=512K (no SPIFFS)
thingdev.menu.FlashSize.512K0.build.flash_size=512K
thingdev.menu.FlashSize.512K0.build.flash_ld=eagle.flash.512k0.ld
thingdev.menu.FlashSize.512K0.build.spiffs_pagesize=256
thingdev.menu.FlashSize.512K0.upload.maximum_size=499696
thingdev.menu.FlashSize.512K64=512K (64K SPIFFS)
thingdev.menu.FlashSize.512K64.build.flash_size=512K
thingdev.menu.FlashSize.512K64.build.flash_ld=eagle.flash.512k64.ld
thingdev.menu.FlashSize.512K64.build.spiffs_pagesize=256
thingdev.menu.FlashSize.512K64.upload.maximum_size=434160
thingdev.menu.FlashSize.512K64.build.spiffs_start=0x6B000
thingdev.menu.FlashSize.512K64.build.spiffs_end=0x7B000
thingdev.menu.FlashSize.512K64.build.spiffs_blocksize=4096
thingdev.menu.FlashSize.512K128=512K (128K SPIFFS)
thingdev.menu.FlashSize.512K128.build.flash_size=512K
thingdev.menu.FlashSize.512K128.build.flash_ld=eagle.flash.512k128.ld
thingdev.menu.FlashSize.512K128.build.spiffs_pagesize=256
thingdev.menu.FlashSize.512K128.upload.maximum_size=368624
thingdev.menu.FlashSize.512K128.build.spiffs_start=0x5B000
thingdev.menu.FlashSize.512K128.build.spiffs_end=0x7B000
thingdev.menu.FlashSize.512K128.build.spiffs_blocksize=4096
thingdev.menu.LwIPVariant.v2mss536=v2 Prebuilt (MSS=536)
thingdev.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
thingdev.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
thingdev.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
thingdev.menu.LwIPVariant.v2mss1460=v2 Prebuilt (MSS=1460, unstable)
thingdev.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
thingdev.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
thingdev.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
thingdev.menu.LwIPVariant.Prebuilt=v1.4 Prebuilt
thingdev.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
thingdev.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
thingdev.menu.LwIPVariant.OpenSource=v1.4 Open Source
thingdev.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
thingdev.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
thingdev.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
thingdev.menu.Debug.Disabled=Disabled
thingdev.menu.Debug.Disabled.build.debug_port=
thingdev.menu.Debug.Serial=Serial
thingdev.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
thingdev.menu.Debug.Serial1=Serial1
thingdev.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
thingdev.menu.DebugLevel.None____=None
thingdev.menu.DebugLevel.None____.build.debug_level=
thingdev.menu.DebugLevel.SSL=SSL
thingdev.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
thingdev.menu.DebugLevel.TLS_MEM=TLS_MEM
thingdev.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
thingdev.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
thingdev.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
thingdev.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
thingdev.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
thingdev.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
thingdev.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
thingdev.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
thingdev.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
thingdev.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
thingdev.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
thingdev.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
thingdev.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
thingdev.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
thingdev.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
thingdev.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
thingdev.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
thingdev.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
thingdev.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
thingdev.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
thingdev.menu.DebugLevel.CORE=CORE
thingdev.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
thingdev.menu.DebugLevel.WIFI=WIFI
thingdev.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
thingdev.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
thingdev.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
thingdev.menu.DebugLevel.UPDATER=UPDATER
thingdev.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
thingdev.menu.DebugLevel.OTA=OTA
thingdev.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
thingdev.menu.DebugLevel.OOM=OOM
thingdev.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
thingdev.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
thingdev.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
thingdev.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
thingdev.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
thingdev.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
thingdev.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
thingdev.menu.UploadSpeed.115200=115200
thingdev.menu.UploadSpeed.115200.upload.speed=115200
thingdev.menu.UploadSpeed.9600=9600
thingdev.menu.UploadSpeed.9600.upload.speed=9600
thingdev.menu.UploadSpeed.57600=57600
thingdev.menu.UploadSpeed.57600.upload.speed=57600
thingdev.menu.UploadSpeed.230400.linux=230400
thingdev.menu.UploadSpeed.230400.macosx=230400
thingdev.menu.UploadSpeed.230400.upload.speed=230400
thingdev.menu.UploadSpeed.256000.windows=256000
thingdev.menu.UploadSpeed.256000.upload.speed=256000
thingdev.menu.UploadSpeed.460800.linux=460800
thingdev.menu.UploadSpeed.460800.macosx=460800
thingdev.menu.UploadSpeed.460800.upload.speed=460800
thingdev.menu.UploadSpeed.512000.windows=512000
thingdev.menu.UploadSpeed.512000.upload.speed=512000
thingdev.menu.UploadSpeed.921600=921600
thingdev.menu.UploadSpeed.921600.upload.speed=921600

