esp8266/Arduino/boards.txt
##############################################################
d1_mini_lite.name=WeMos D1 mini Lite
d1_mini_lite.build.board=ESP8266_WEMOS_D1MINILITE
d1_mini_lite.build.variant=d1_mini
d1_mini_lite.upload.tool=esptool
d1_mini_lite.upload.maximum_data_size=81920
d1_mini_lite.upload.wait_for_upload_port=true
d1_mini_lite.serial.disableDTR=true
d1_mini_lite.serial.disableRTS=true
d1_mini_lite.build.mcu=esp8266
d1_mini_lite.build.core=esp8266
d1_mini_lite.build.spiffs_pagesize=256
d1_mini_lite.build.debug_port=
d1_mini_lite.build.debug_level=
d1_mini_lite.menu.CpuFrequency.80=80 MHz
d1_mini_lite.menu.CpuFrequency.80.build.f_cpu=80000000L
d1_mini_lite.menu.CpuFrequency.160=160 MHz
d1_mini_lite.menu.CpuFrequency.160.build.f_cpu=160000000L
d1_mini_lite.upload.resetmethod=nodemcu
d1_mini_lite.build.flash_mode=dout
d1_mini_lite.build.flash_freq=40
d1_mini_lite.menu.FlashSize.1M0=1M (no SPIFFS)
d1_mini_lite.menu.FlashSize.1M0.build.flash_size=1M
d1_mini_lite.menu.FlashSize.1M0.build.flash_ld=eagle.flash.1m0.ld
d1_mini_lite.menu.FlashSize.1M0.build.spiffs_pagesize=256
d1_mini_lite.menu.FlashSize.1M0.upload.maximum_size=1023984
d1_mini_lite.menu.FlashSize.1M64=1M (64K SPIFFS)
d1_mini_lite.menu.FlashSize.1M64.build.flash_size=1M
d1_mini_lite.menu.FlashSize.1M64.build.flash_ld=eagle.flash.1m64.ld
d1_mini_lite.menu.FlashSize.1M64.build.spiffs_pagesize=256
d1_mini_lite.menu.FlashSize.1M64.upload.maximum_size=958448
d1_mini_lite.menu.FlashSize.1M64.build.spiffs_start=0xEB000
d1_mini_lite.menu.FlashSize.1M64.build.spiffs_end=0xFB000
d1_mini_lite.menu.FlashSize.1M64.build.spiffs_blocksize=4096
d1_mini_lite.menu.FlashSize.1M128=1M (128K SPIFFS)
d1_mini_lite.menu.FlashSize.1M128.build.flash_size=1M
d1_mini_lite.menu.FlashSize.1M128.build.flash_ld=eagle.flash.1m128.ld
d1_mini_lite.menu.FlashSize.1M128.build.spiffs_pagesize=256
d1_mini_lite.menu.FlashSize.1M128.upload.maximum_size=892912
d1_mini_lite.menu.FlashSize.1M128.build.spiffs_start=0xDB000
d1_mini_lite.menu.FlashSize.1M128.build.spiffs_end=0xFB000
d1_mini_lite.menu.FlashSize.1M128.build.spiffs_blocksize=4096
d1_mini_lite.menu.FlashSize.1M144=1M (144K SPIFFS)
d1_mini_lite.menu.FlashSize.1M144.build.flash_size=1M
d1_mini_lite.menu.FlashSize.1M144.build.flash_ld=eagle.flash.1m144.ld
d1_mini_lite.menu.FlashSize.1M144.build.spiffs_pagesize=256
d1_mini_lite.menu.FlashSize.1M144.upload.maximum_size=876528
d1_mini_lite.menu.FlashSize.1M144.build.spiffs_start=0xD7000
d1_mini_lite.menu.FlashSize.1M144.build.spiffs_end=0xFB000
d1_mini_lite.menu.FlashSize.1M144.build.spiffs_blocksize=4096
d1_mini_lite.menu.FlashSize.1M160=1M (160K SPIFFS)
d1_mini_lite.menu.FlashSize.1M160.build.flash_size=1M
d1_mini_lite.menu.FlashSize.1M160.build.flash_ld=eagle.flash.1m160.ld
d1_mini_lite.menu.FlashSize.1M160.build.spiffs_pagesize=256
d1_mini_lite.menu.FlashSize.1M160.upload.maximum_size=860144
d1_mini_lite.menu.FlashSize.1M160.build.spiffs_start=0xD3000
d1_mini_lite.menu.FlashSize.1M160.build.spiffs_end=0xFB000
d1_mini_lite.menu.FlashSize.1M160.build.spiffs_blocksize=4096
d1_mini_lite.menu.FlashSize.1M192=1M (192K SPIFFS)
d1_mini_lite.menu.FlashSize.1M192.build.flash_size=1M
d1_mini_lite.menu.FlashSize.1M192.build.flash_ld=eagle.flash.1m192.ld
d1_mini_lite.menu.FlashSize.1M192.build.spiffs_pagesize=256
d1_mini_lite.menu.FlashSize.1M192.upload.maximum_size=827376
d1_mini_lite.menu.FlashSize.1M192.build.spiffs_start=0xCB000
d1_mini_lite.menu.FlashSize.1M192.build.spiffs_end=0xFB000
d1_mini_lite.menu.FlashSize.1M192.build.spiffs_blocksize=4096
d1_mini_lite.menu.FlashSize.1M256=1M (256K SPIFFS)
d1_mini_lite.menu.FlashSize.1M256.build.flash_size=1M
d1_mini_lite.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
d1_mini_lite.menu.FlashSize.1M256.build.spiffs_pagesize=256
d1_mini_lite.menu.FlashSize.1M256.upload.maximum_size=761840
d1_mini_lite.menu.FlashSize.1M256.build.spiffs_start=0xBB000
d1_mini_lite.menu.FlashSize.1M256.build.spiffs_end=0xFB000
d1_mini_lite.menu.FlashSize.1M256.build.spiffs_blocksize=4096
d1_mini_lite.menu.FlashSize.1M512=1M (512K SPIFFS)
d1_mini_lite.menu.FlashSize.1M512.build.flash_size=1M
d1_mini_lite.menu.FlashSize.1M512.build.flash_ld=eagle.flash.1m512.ld
d1_mini_lite.menu.FlashSize.1M512.build.spiffs_pagesize=256
d1_mini_lite.menu.FlashSize.1M512.upload.maximum_size=499696
d1_mini_lite.menu.FlashSize.1M512.build.spiffs_start=0x7B000
d1_mini_lite.menu.FlashSize.1M512.build.spiffs_end=0xFB000
d1_mini_lite.menu.FlashSize.1M512.build.spiffs_blocksize=8192
d1_mini_lite.menu.LwIPVariant.v2mss536=v2 Prebuilt (MSS=536)
d1_mini_lite.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
d1_mini_lite.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
d1_mini_lite.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
d1_mini_lite.menu.LwIPVariant.v2mss1460=v2 Prebuilt (MSS=1460, unstable)
d1_mini_lite.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
d1_mini_lite.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
d1_mini_lite.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
d1_mini_lite.menu.LwIPVariant.Prebuilt=v1.4 Prebuilt
d1_mini_lite.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
d1_mini_lite.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
d1_mini_lite.menu.LwIPVariant.OpenSource=v1.4 Open Source
d1_mini_lite.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
d1_mini_lite.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
d1_mini_lite.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
d1_mini_lite.menu.Debug.Disabled=Disabled
d1_mini_lite.menu.Debug.Disabled.build.debug_port=
d1_mini_lite.menu.Debug.Serial=Serial
d1_mini_lite.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
d1_mini_lite.menu.Debug.Serial1=Serial1
d1_mini_lite.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
d1_mini_lite.menu.DebugLevel.None____=None
d1_mini_lite.menu.DebugLevel.None____.build.debug_level=
d1_mini_lite.menu.DebugLevel.SSL=SSL
d1_mini_lite.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
d1_mini_lite.menu.DebugLevel.TLS_MEM=TLS_MEM
d1_mini_lite.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
d1_mini_lite.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
d1_mini_lite.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
d1_mini_lite.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
d1_mini_lite.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
d1_mini_lite.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
d1_mini_lite.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
d1_mini_lite.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
d1_mini_lite.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
d1_mini_lite.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
d1_mini_lite.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
d1_mini_lite.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
d1_mini_lite.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
d1_mini_lite.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
d1_mini_lite.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
d1_mini_lite.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
d1_mini_lite.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
d1_mini_lite.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
d1_mini_lite.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
d1_mini_lite.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
d1_mini_lite.menu.DebugLevel.CORE=CORE
d1_mini_lite.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
d1_mini_lite.menu.DebugLevel.WIFI=WIFI
d1_mini_lite.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
d1_mini_lite.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
d1_mini_lite.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
d1_mini_lite.menu.DebugLevel.UPDATER=UPDATER
d1_mini_lite.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
d1_mini_lite.menu.DebugLevel.OTA=OTA
d1_mini_lite.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
d1_mini_lite.menu.DebugLevel.OOM=OOM
d1_mini_lite.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
d1_mini_lite.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
d1_mini_lite.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
d1_mini_lite.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
d1_mini_lite.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -include "umm_malloc/umm_malloc_cfg.h"
d1_mini_lite.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
d1_mini_lite.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
d1_mini_lite.menu.UploadSpeed.921600=921600
d1_mini_lite.menu.UploadSpeed.921600.upload.speed=921600
d1_mini_lite.menu.UploadSpeed.9600=9600
d1_mini_lite.menu.UploadSpeed.9600.upload.speed=9600
d1_mini_lite.menu.UploadSpeed.57600=57600
d1_mini_lite.menu.UploadSpeed.57600.upload.speed=57600
d1_mini_lite.menu.UploadSpeed.115200=115200
d1_mini_lite.menu.UploadSpeed.115200.upload.speed=115200
d1_mini_lite.menu.UploadSpeed.230400.linux=230400
d1_mini_lite.menu.UploadSpeed.230400.macosx=230400
d1_mini_lite.menu.UploadSpeed.230400.upload.speed=230400
d1_mini_lite.menu.UploadSpeed.256000.windows=256000
d1_mini_lite.menu.UploadSpeed.256000.upload.speed=256000
d1_mini_lite.menu.UploadSpeed.460800.linux=460800
d1_mini_lite.menu.UploadSpeed.460800.macosx=460800
d1_mini_lite.menu.UploadSpeed.460800.upload.speed=460800
d1_mini_lite.menu.UploadSpeed.512000.windows=512000
d1_mini_lite.menu.UploadSpeed.512000.upload.speed=512000

